questions = [
    #('name', '귀하의 이름은 무엇입니까? >> ',None, False),
    #('age', '귀하의 생년월일을 입력해주세요. (예: 1960-01-01) >> ',None, False),
    #('address', '귀하의 주소를 입력해주세요. >> ',None, False),
    #('phone', '귀하의 전화번호를 입력해주세요. (예: 010-1234-5678) >> ',None, False),
    #('education','재학 기간, 학교명 및 전공, 구분을 포함하여 귀하의 최종학력을 입력해주세요. (예: 1993-1997, 연세대학교 행정학, 학사) >> ',None, False),
    #('wish', '귀하의 희망 직무를 입력해주세요. (예: 마케팅, 영업, 개발 등) >> ',None, False),
    #('wish2','귀하의 희망 업종을 입력해주세요. (예: IT, 금융, 제조 등) >> ',None, False),
    #('wish3','귀하의 희망 근무지를 입력해주세요. (예: 서울 중구, 경기 성남 등) >> ',None, False),
    #('hope', '귀하의 희망 월급을 입력해주세요. (예: 100만원) >> ',None, False),
    #('hope2', '희망하시는 근무 형태를 선택해주세요', ['기간에 정함이 있는 근로계약', '기간에 정함이 없는 근로계약', '시간제','교대제 근무','파견근로','재택근무 희망','대체인력'], True),
    #('hope3', '귀하의 희망 근무시간을 입력해주세요. (예: 9시~18시) >> ',None, False),
    #('hope4', '귀하의 희망 근무요일을 입력해주세요. (예: 월~금요일) >> ',None, False),
    #('condition','운전면허가 있으십니까? (예: 있음, 없음) >> ',None, False),
    #('condition2','개인 차량을 소유하고 계십니까? (예: 있음, 없음) >> ',None, False),
    #('condition3', '사용 가능한 언어를 입력해주세요. (예: 한국어, 영어, 중국어 등) >> ',None, False),
    #('condition4','보유하고 계신 자격증을 입력해주세요. (예: TOEIC, 한국사, 컴퓨터활용능력 등) >> ',None, False),
    ('career', '''이력서 및 자기소개서 작성을 위해 경력정보가 필요합니다. 근무하신 기간과 직책을 포함하여 수행하신 업무에 관한 정보를 알려주세요. 
     채용 담당자의 눈에 띄기 위해 업무를 수행하시는동안 달성하신 성과나 강조하고 싶은 사항이 있으시다면 구체적으로 언급해주세요.
     답변은 작성하실 필요 없이, 녹음하신 뒤 파일 경로를 입력해주시면 자동으로 답변을 추출해드립니다  >> '''),
    ('career2', '귀하의 지원 동기와 직무 적합성을 간략하게 소개해주세요. 답변은 작성하실 필요 없이, 녹음하신 뒤 파일 경로를 입력해주시면 자동으로 답변을 추출해드립니다 >> '),
    ('career3', '자기소개서 작성을 위해 추가적인 정보가 필요합니다. 귀하의 성격과 강점을 간략하게 소개해주세요. 답변은 작성하실 필요 없이, 녹음하신 뒤 파일 경로를 입력해주시면 자동으로 답변을 추출해드립니다 >> ')
]